docs/oviva_linted.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b
        </Action>
        <MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:3e9d425c-bd3f-4991-b23e-d228492a68b3
        </MessageID>
        <To xmlns="http://www.w3.org/2005/08/addressing">http://epa-as-2.dev.epa4all.de/epa/xds-document/api/I_Document_Management
        </To>
        <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
            <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
        </ReplyTo>
    </soap:Header>
    <soap:Body>
        <ns5:ProvideAndRegisterDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns5="urn:ihe:iti:xds-b:2007" xmlns:ns6="urn:ihe:iti:rmd:2017">
            <ns4:SubmitObjectsRequest>
                <RegistryObjectList>
                    <RegistryPackage id="e3cbb55d-76b7-47dd-ba3c-b7e29aebbede" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
                        <Slot name="submissionTime">
                            <ValueList>
                                <Value>20241217170110</Value>
                            </ValueList>
                        </Slot>
                        <Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="e3cbb55d-76b7-47dd-ba3c-b7e29aebbede" id="b99d8613-9e70-4fa6-b719-434c7109ea5f" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="authorPerson">
                                <ValueList>
                                    <Value>9-SMC-B-Testkarte-883110000145356^Oviva Direkt für Adipositas^Oviva AG^^^^^^&amp;1.2.276.0.76.4.282&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorRole">
                                <ValueList>
                                    <Value>12^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.13&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorInstitution">
                                <ValueList>
                                    <Value>Oviva^^^^^&amp;1.2.276.0.76.4.188&amp;ISO^^^^9-SMC-B-Testkarte-883110000145356</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorSpecialty">
                                <ValueList>
                                    <Value>25^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.11&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorTelecommunication">
                                <ValueList>
                                    <Value>^^Internet^telematik-infrastructure@oviva.com</Value>
                                </ValueList>
                            </Slot>
                        </Classification>
                        <Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="e3cbb55d-76b7-47dd-ba3c-b7e29aebbede" id="422a6985-3e0c-495c-8fca-fbcb07922a4b" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"></Classification>
                        <ExternalIdentifier id="a1881994-1dbe-4c64-a7c4-7bb9888e2246" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="e3cbb55d-76b7-47dd-ba3c-b7e29aebbede" value="X110580673^^^&amp;1.2.276.0.76.4.8&amp;ISO">
                            <Name>
                                <LocalizedString charset="UTF-8" value="XDSSubmissionSet.patientId" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </ExternalIdentifier>
                        <ExternalIdentifier id="b69e7b7d-efaa-480f-ba8b-82a940cca3ef" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="e3cbb55d-76b7-47dd-ba3c-b7e29aebbede" value="2.25.269216263585041439174">
                            <Name>
                                <LocalizedString charset="UTF-8" value="XDSSubmissionSet.uniqueId" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </ExternalIdentifier>
                    </RegistryPackage>
                    <ExtrinsicObject id="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" isOpaque="false" mimeType="text/plain" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
                        <Slot name="creationTime">
                            <ValueList>
                                <Value>20241217140110</Value>
                            </ValueList>
                        </Slot>
                        <Slot name="languageCode">
                            <ValueList>
                                <Value>de-DE</Value>
                            </ValueList>
                        </Slot>
                        <Slot name="URI">
                            <ValueList>
                                <Value>Oviva_DiGA_Export_2024-12-17T17:01:10.762404</Value>
                            </ValueList>
                        </Slot>
                        <Name>
                            <LocalizedString charset="UTF-8" value="ePA Export Oviva Direkt for Obesity 2024-12-17T17:01:10.762404" xml:lang="de-DE"></LocalizedString>
                        </Name>
                        <Description>
                            <LocalizedString charset="UTF-8" value="DiGA MIO-Beispiel eines Dokument von Referenzimplementierung geschickt (Simple Roundtrip)" xml:lang="de-DE"></LocalizedString>
                        </Description>
                        <Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" id="2a9405b9-8312-4d80-abc5-bfffce10aaca" nodeRepresentation="DUR" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.8</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString charset="UTF-8" value="Durchführungsprotokoll" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" id="d4c2b4cd-5287-4b59-b161-98d45a79ca31" nodeRepresentation="N" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>2.16.840.1.113883.5.25</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString charset="UTF-8" value="normal" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" classifiedObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" id="55fafb02-1058-44ad-869b-3729e734ceb5" nodeRepresentation="E400" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.16</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString charset="UTF-8" value="Virtual Encounter" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" classifiedObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" id="06d93bb7-2405-4a86-a85a-413f6674a3e7" nodeRepresentation="H1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.15</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString charset="UTF-8" value="vom Patienten mitgebracht" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" id="239c70e7-7e88-456c-a250-e7a1e0dc2501" nodeRepresentation="urn:gematik:ig:diga:v1.1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.6</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString charset="UTF-8" value="DiGA (gematik) v1.1" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" id="9d6372e3-14c8-417c-8ce2-46945f5a7d9d" nodeRepresentation="PAT" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.3</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString charset="UTF-8" value="Patient außerhalb der Betreuung" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" id="8d4e9be6-c758-4e10-9311-6b2033ad4df6" nodeRepresentation="PAT" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.5</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString charset="UTF-8" value="Patient außerhalb der Betreuung" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" id="d5b8dd29-6421-460c-b6f7-3236c59e0409" nodeRepresentation="PATD" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="codingScheme">
                                <ValueList>
                                    <Value>1.3.6.1.4.1.19376.3.276.1.5.9</Value>
                                </ValueList>
                            </Slot>
                            <Name>
                                <LocalizedString charset="UTF-8" value="Patienteneigene Dokumente" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </Classification>
                        <Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" id="377bcfd3-12f3-428d-9322-fa39a5b03d0c" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                            <Slot name="authorPerson">
                                <ValueList>
                                    <Value>9-SMC-B-Testkarte-883110000145356^Oviva Direkt für Adipositas^Oviva AG^^^^^^&amp;1.2.276.0.76.4.282&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorRole">
                                <ValueList>
                                    <Value>12^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.13&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorInstitution">
                                <ValueList>
                                    <Value>Oviva^^^^^&amp;1.2.276.0.76.4.188&amp;ISO^^^^9-SMC-B-Testkarte-883110000145356</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorSpecialty">
                                <ValueList>
                                    <Value>25^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.11&amp;ISO</Value>
                                </ValueList>
                            </Slot>
                            <Slot name="authorTelecommunication">
                                <ValueList>
                                    <Value>^^Internet^telematik-infrastructure@oviva.com</Value>
                                </ValueList>
                            </Slot>
                        </Classification>
                        <ExternalIdentifier id="45fd2aa5-3344-498c-a630-19246c3315b3" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" value="X110580673^^^&amp;1.2.276.0.76.4.8&amp;ISO">
                            <Name>
                                <LocalizedString charset="UTF-8" value="XDSDocumentEntry.patientId" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </ExternalIdentifier>
                        <ExternalIdentifier id="90576446-de34-4630-b3b0-74fef9d90926" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0" value="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0">
                            <Name>
                                <LocalizedString charset="UTF-8" value="XDSDocumentEntry.uniqueId" xml:lang="de-DE"></LocalizedString>
                            </Name>
                        </ExternalIdentifier>
                    </ExtrinsicObject>
                    <Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="cb241c7b-9aa1-48bb-9a83-db07dd535032" sourceObject="e3cbb55d-76b7-47dd-ba3c-b7e29aebbede" targetObject="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0"></Association>
                </RegistryObjectList>
            </ns4:SubmitObjectsRequest>
            <ns5:Document id="urn:uuid:a148bc66-b309-4f12-b849-67fe026419b0">
                <xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:3cf1087b-4d1a-447d-9aa0-dce9c05d1a63-1@urn%3Aihe%3Aiti%3Axds-b%3A2007"></xop:Include>
            </ns5:Document>
        </ns5:ProvideAndRegisterDocumentSetRequest>
    </soap:Body>
</soap:Envelope>